{
    "Aldreic": {
        "start": {
            "text": "The village hums with its usual calm, and your trusted friend stands beside you. Will you spend the day preparing for what lies ahead or savoring a rare moment of peace with your closest companion?",
            "choices": {
                "Help fortify the village with the elders.":                      "Choose_Weapon",
                
                "Practice sparring on your own. You could use the practice..":                                                                                                                                                      "Sparring",
                "Play with Thane, he insists it’s a beutiful day.":               "Play_With_Thane"
            },
            "outcomes": {
                "Help fortify the village with the elders.": {
                    "text": "You reinforce the village walls and mend gaps in old traps. As you work, an unease feeling settles over you... Somethings off—like a storm is on the horizon",
                    "background": "NewVillage",
                    "death": false
                },
                "Practice sparring on your own. You could use the practice..": {
                    "text": "You step beyond the village, venturing deep into the forest. The quiet surrounds you as you ready your stance—each strike, each movement sharpening your skill. But in the stillness, something watches.",
                    "background": "NewVillage",
                    "death": false
                },
                "Play with Thane, he insists it’s a beutiful day.": {
                    "text": "The warmth of the sun and laughter make the day feel endless—until it isn’t. There's a  figure approaching from the distance, it's unfamiliar and unsteady. Then, you see it—something sickly, reaking of death.",
                    "background": "NewVillage",
                    "death": false
                }
            }
        },
        "Choose_Weapon": {
            "text": "Chaos erupts as word spreads—raiders are pillaging nearby farms. The village stirs in panic, scrambling for a defense, but fear grips the air like a storm on the horizon. There’s no time to hesitate. What will you do?",
            "choices": {
                "Take a stand and fight for your home.":                                                                                                                                                             "Weapon_Selected",
                "Who are they? Why are they here...":                                                                                                                                         "Weapon_Selected",
                "Abandon the village before it’s too late.":                                                                                                                                                        "Abandon_Village"
            },
            "outcomes": {
                "Take a stand and fight for your home.": {
                    "text": "This village is everything you know, and you refuse to let it fall. Gripping whatever weapon you can find, you prepare to face the coming storm—no matter the cost. The elders bark orders, rallying those willing to fight. The air is thick with tension, the weight of what’s to come settling deep in your chest.",
                    "background": "VillageRaid",
                    "death": false
                },
                "Who are they? Why are they here...": {
                    "text": "Your heart pounds, and your breath quickens. The shouting, the chaos—it all blurs together. Your legs refuse to move as dread roots you to the ground. Every instinct screams at you to run, to fight, to do something—but fear has locked you in place. If you don’t act soon, the choice will no longer be yours to make.",
                    "background": "VillageRaid",
                    "death": false
                },
                "Abandon the village before it’s too late.": {
                    "text": "This village is everything you know, and you refuse to let it fall. Gripping whatever weapon you can find, you prepare to face the coming storm—no matter the cost. The elders bark orders, rallying those willing to fight. The air is thick with tension, the weight of what’s to come settling deep in your chest.",
                    "background": "Village",
                    "death": false
                }
            }
        },
        "Weapon_Selected": {
            "text": "The village gathers, tension thick in the air as makeshift weapons are passed around. The elders give hurried instructions, their voices steady despite the fear in their eyes. In the distance, the dust from approaching raiders rises like a warning. There's no turning back now.",
            "choices": {
                "Brace yourself for the fight ahead, positioning yourself among the defenders.": "Fight_Ahead",
                
                "Try to shake off the fear before it’s too late.":                              "DEATH",
                
                "Run away, putting as much distance between you and the battle as possible.": "Abandon_Village"
            },
            "outcomes": {
                "Brace yourself for the fight ahead, positioning yourself among the defenders.": {
                    "text": "You grip your weapon tightly, muscles tensed, every sense on high alert. The moment drags, stretching unbearably thin—until the first battle cry shatters the silence. The raiders have arrived.",
                    "background": "SmokingCity",
                    "death": false
                },
                "Try to shake off the fear before it’s too late.": {
                    "text": "Your breath is shallow, hands clammy. It takes everything in you to take a step forward, then another. But the time for hesitation has passed. Your hesitation has cost you your life.",
                    "background": "SmokingCity",
                    "death": true
                },
                "Run away, putting as much distance between you and the battle as possible.": {
                    "text": "The forest grows darker as the sounds of the village slip away. Every step feels heavier, weighed down by the uncertainty of what you left behind. You’ve escaped, but at what cost?",
                    "background": "Village",
                    "death": false
                }
            }
        },
        
        "Abandon_Village": {
            "text": "You don’t look back. The sounds of the village fade behind you, swallowed by the thick trees and the weight of your decision. Each step carries you further from the place you once called home, but the air feels heavy, as if the forest itself is watching. Then, you hear it—movement in the distance. You’re not alone.",
            "choices": {
                "Call out, demanding to know who—or what—is following you.": "Call_Out",
                
                "Pick up your pace, hoping to lose them in the trees.": "Pick_Pace",
                
                "Find a hiding place and wait to see what they do.": "DEATH"
            },
            "outcomes": {
                "Call out, demanding to know who—or what—is following you.": {
                    "text": "Your voice cuts through the silence, but no response comes. The footsteps stop. The air feels colder, heavier. Then, just as you think you're alone again, a whisper brushes against your ear—too close to have come from where they stood.",
                    "background": "VillageRaid",
                    "death": false
                },
                "Pick up your pace, hoping to lose them in the trees.": {
                    "text": "You quicken your steps, heart pounding, but so do they. The steady rhythm of their footsteps never falters, never falls behind. No matter how fast you move, they follow, matching you step for step.",
                    "background": "VillageRaid",
                    "death": false
                },
                "Find a hiding place and wait to see what they do.": {
                    "text": "You slip into the shadows, pressing yourself against the rough bark of a tree. The footsteps stop. Silence stretches, unbearable. Then, soft breathing—just on the other side of the trunk.",
                    "background": "",
                    "death": true
                }
            }
        },

        "Fight_Ahead": {
            "text": "The ground trembles beneath your feet as the raiders charge. The village defenders brace themselves, gripping their weapons with white-knuckled hands. Screams and battle cries mix in the air, drowning out all else. There’s no more time to think—only to act.",
            "choices": {
                "Stand your ground and meet the enemy head-on.": "Stand_Ground",
                
                "Stay behind cover and look for an opening.": "Behind_Cover",
                
                "Look for the village leader, hoping for orders.": "Village_Leader"
            },
            "outcomes": {
                "Stand your ground and meet the enemy head-on.": {
                    "text": "You plant your feet and raise your weapon, waiting for the first raider to reach you. When they do, steel clashes, the force of their attack nearly knocking you off balance. This isn’t practice. This is survival.",
                    "background": "fog.jpg",
                    "death": false
                },
                "Stay behind cover and look for an opening.": {
                    "text": "You duck behind an overturned cart, scanning the battlefield. The chaos is overwhelming, but hesitation means death. You spot an opening—one of the raiders has broken away from the group, unaware of your presence. This could be your chance.",
                    "background": "shadow.jpg",
                    "death": false
                },
                "Look for the village leader, hoping for orders.": {
                    "text": "You scan the battlefield, searching for the village leader among the chaos. You spot them shouting commands, their blade already stained with battle. But before you can reach them, a shadow looms over you—a raider, weapon raised. There’s no time to run.",
                    "background": "castle.jpg",
                    "death": false
                }
            }
        },
        
        "Stand_Ground": {
            "text": "The clash of steel rings in your ears as you parry blow after blow. The raider is relentless, their strikes fueled by bloodlust. Your muscles burn, but you hold your ground. Then, out of the corner of your eye, you see another raider closing in. You have to make a decision—fast.",
            "choices": {
                "Hold your ground and brace for the second attacker.": "Brace_Second",
                "Attempt to disengage and reposition.": "Brace_Second",
                "Strike first before they can reach you.": "Brace_Second"
            },
            "outcomes": {
                "Hold your ground and brace for the second attacker.": {
                    "text": "You tighten your grip and steel yourself for impact. The second raider crashes into you, the force nearly sending you to the ground. Pain shoots through your ribs, but you're still standing. The fight isn’t over.",
                    "background": "Crafting",
                    "death": false
                },
                "Attempt to disengage and reposition.": {
                    "text": "You break away, sidestepping as the second raider lunges. Their blade narrowly misses, but now you’re out of position. The first raider recovers quickly, turning to face you once more.",
                    "background": "Crafting",
                    "death": false
                },
                "Strike first before they can reach you.": {
                    "text": "You pivot, lashing out with your weapon before the second raider can strike. Your blade finds flesh, and they stagger. The first raider hesitates, but only for a moment. The fight continues.",
                    "background": "Crafting",
                    "death": false
                }
            }
        },

        "Behind_Cover": {
            "text": "The overturned cart shields you from the chaos, but the battle rages on. The raider you spotted is still unaware of you, but they won’t be for long. Time is running out.",
            "choices": {
                "Ambush the raider while they’re distracted.": "Ambush",
                "Wait for them to move closer before striking.": "Ambush",
                "Use the cart for cover and look for another way out.": "DEATH"
            },
            "outcomes": {
                "Ambush the raider while they’re distracted.": {
                    "text": "You leap from cover, striking before the raider can react. Their eyes widen in shock, but it’s too late. They collapse, and you turn to assess the battlefield once more.",
                    "background": "shadows.jpg",
                    "death": false
                },
                "Wait for them to move closer before striking.": {
                    "text": "You hold your breath, waiting as the raider moves closer. When they’re within reach, you spring forward. They manage to raise their weapon, but your strike lands first. The fight isn’t over, but you’ve gained the upper hand.",
                    "background": "tension.jpg",
                    "death": false
                },
                "Use the cart for cover and look for another way out.": {
                    "text": "You scan for another way out, but before you can move, another raider spots you. Their shout alerts the others. You’ve lost the element of surprise.",
                    "background": "exposed.jpg",
                    "death": true
                }
            }
        },

        "Village_Leader": {
            "text": "The village elder is locked in combat, their blade flashing as they fend off attackers. They glance your way, assessing your presence. ‘We need to hold the line!’ they shout. But how?",
            "choices": {
                "Take command of nearby villagers and rally them.": "Rally_Villagers",
                "Find a higher vantage point to survey the battle.": "Death",
                "Stay close to the leader and fight alongside them.": "Rally_Villagers"
            },
            "outcomes": {
                "Take command of nearby villagers and rally them.": {
                    "text": "You call out to the nearby villagers, urging them to hold their ground. Some hesitate, but others respond, gripping their weapons with newfound resolve. The tide of battle shifts ever so slightly.",
                    "background": "rally.jpg",
                    "death": false
                },
                "Find a higher vantage point to survey the battle.": {
                    "text": "You break away, climbing onto a collapsed structure to survey the battlefield. The scene is grim, but you spot an opening—one that could turn the fight in your favor if acted on swiftly, before your able to act your stuck with an arrow",
                    "background": "high_ground.jpg",
                    "death": true
                },
                "Stay close to the leader and fight alongside them.": {
                    "text": "You stand beside the village elder, matching their movements as they fight. The weight of responsibility settles over you, but there’s no time for doubt. The battle continues.",
                    "background": "Crafting",
                    "death": false
                }
            }
        },

        "Call_Out": {
            "text": "Your voice cuts through the silence, but the stillness that follows is unnerving. The whisper lingers in your ear, an icy breath that makes your skin crawl. Then—movement behind you. Something is there.",
            "choices": {
                "Turn around and confront it head-on.": "DEATH",
                "Slowly back away, keeping your eyes forward.": "Death",
                "Run without looking back.": "DEATH"
            },
            "outcomes": {
                "Turn around and confront it head-on.": {
                    "text": "You turn swiftly, weapon ready. But there’s nothing. Just empty air. A chill runs down your spine as laughter—soft, mocking—echoes from the trees.",
                    "background": "mist.jpg",
                    "death": true
                },
                "Slowly back away, keeping your eyes forward.": {
                    "text": "You step backward, careful not to make a sound. The whisper follows, growing clearer with each step. It’s speaking your name.",
                    "background": "forest_dark.jpg",
                    "death": true
                },
                "Run without looking back.": {
                    "text": "Panic surges through you, and you sprint into the trees. The whisper turns into a chorus, voices murmuring from the darkness. They are all around you now.",
                    "background": "running.jpg",
                    "death": true
                }
            }
        },


        "Pick_Pace": {
                  "text": "You push forward, weaving through the trees, heart pounding. The footsteps behind you remain steady, neither slowing nor quickening. The presence follows with an unsettling calm. The path ahead splits in two.",
                  "choices": {
                      "Take the left path, deeper into the forest.": "DEATH",
                      "Take the right path, toward open ground.": "DEATH",
                      "Climb a tree and wait to see who follows.": "DEATH"
                  },
                  "outcomes": {
                      "Take the left path, deeper into the forest.": {
                          "text": "You veer left, plunging deeper into the woods. The canopy thickens, blocking the moonlight. The air grows colder. The footsteps stop, but an eerie silence follows instead.",
                          "background": "SmokingCity",
                          "death": true
                      },
                      "Take the right path, toward open ground.": {
                          "text": "You sprint toward open ground, hoping to lose them in the moonlight. But as the trees thin, a shadow stretches across your path—something, or someone, is already waiting.",
                          "background": "SmokingCity",
                          "death": true
                      },
                      "Climb a tree and wait to see who follows.": {
                          "text": "You scramble up the nearest tree, pressing yourself against the bark. The footsteps continue below, pausing right at the base of your hiding place. A whisper drifts upward: 'I see you.'",
                          "background": "SmokingCity",
                          "death": true
                      }
                  }
              },
        
        "Ambush": {
            "text": "Perched high above the tumult, you spot the raider oblivious to your presence as they navigate the chaos below. The perfect moment to launch an ambush is at your fingertips, yet the battlefield remains unpredictable.",
            "choices": {
              "Leap down and attack with the element of surprise.": "Knights_Arrive",
              "Take aim from above and deliver a ranged assault.": "Knights_Arrive",
              "Hold your position to wait for a clearer shot.": "DEATH"
            },
            "outcomes": {
              "Leap down and attack with the element of surprise.": {
                "text": "You spring from your elevated perch, crashing down onto the raider with a force that shatters their focus. The sudden strike leaves them reeling, granting you the upper hand in this skirmish.",
                "background": "surprise_strike.jpg",
                "death": false
              },
              "Take aim from above and deliver a ranged assault.": {
                "text": "With practiced precision, you take aim and unleash a well-placed shot. The projectile finds its mark, stunning the raider momentarily and tilting the balance of combat in your favor.",
                "background": "ranged_attack.jpg",
                "death": false
              },
              "Hold your position to wait for a clearer shot.": {
                "text": "You decide to bide your time, but hesitation proves costly. The raider, alerted by a sudden shift in the battle's rhythm, notices your presence and reacts swiftly. Your window of opportunity closes as you become exposed.",
                "background": "exposed_position.jpg",
                "death": true
              }
            }
          },
        "Knights_Arrive": {
            "text": "As the battle reaches a fever pitch, the thunder of hooves shatters the din of clashing steel. A proud line of knights, their armor gleaming in the waning light, bursts onto the field. Their arrival is a turning point, yet the chaos persists and demands swift decisions.",
            "choices": {
              "Rush forward to join the knights and overwhelm the enemy.": "Battle_Finale",
              "Hold your ground and let the knights take the lead.": "Battle_Finale",
              "Break away to target an enemy commander's flank.": "Battle_Finale"
            },
            "outcomes": {
              "Rush forward to join the knights and overwhelm the enemy.": {
                "text": "You charge alongside the knights, your blades singing in unison with theirs. The combined assault shatters the enemy's formation, turning the tide of battle as foes retreat in confusion.",
                "background": "NewVillage",
                "death": false
              },
              "Hold your ground and let the knights take the lead.": {
                "text": "You remain in your position, relying on the knights to spearhead the attack. Their disciplined advance creates gaps in the enemy's defenses, but standing alone leaves you exposed to stray strikes.",
                "background": "NewVillage",
                "death": false
              },
              "Break away to target an enemy commander's flank.": {
                "text": "In a daring move, you slip away from the main fray to target an enemy commander. However, your isolation becomes your undoing—a hidden enemy marksman seizes the opportunity, and a fatal arrow finds you before you can alter the course of battle.",
                "background": "NewVillage",
                "death": true
              }
            }
          },

        "Battle_Finale": {
            "text": "Your ambush has unsettled the enemy. Knights now flood the field. Choose your final move:",
            "choices": {
              "Charge with the knights for a final assault.": "Finale",
              "Hold your ground until all enemies fall.": "Finale",
              "Sneak behind enemy lines to kill their leader.": "Battle_Finale"
            },
            "outcomes": {
              "Charge with the knights for a final assault.": {
                "text": "You charge with the knights, breaking the enemy line. Victory is yours.",
                "background": "NewVillage",
                "death": false
              },
              "Hold your ground until all enemies fall.": {
                "text": "You hold firm. The enemy retreats, and the battle is won.",
                "background": "NewVillage",
                "death": false
              },
              "Sneak behind enemy lines to kill their leader.": {
                "text": "You slip away, but an ambush claims your life.",
                "background": "NewVillage",
                "death": true
              }
            }
          },
        "Brace_Second": {
            "text": "Battered but not beaten, you catch your breath as the chaos momentarily subsides. The enemy wavers—what's your next move?",
            "choices": {
              "Attack immediately to exploit their confusion.": "Ambush",
              "Step back to reassess your position.": "Ambush",
              "Call out to rally your nearby allies.": "Ambush"
            },
            "outcomes": {
              "Attack immediately to exploit their confusion.": {
                "text": "You surge forward, landing a swift blow that throws the enemy into disarray.",
                "background": "attack.jpg",
                "death": true
              },
              "Step back to reassess your position.": {
                "text": "You retreat briefly, regaining composure and preparing for the next wave.",
                "background": "reposition.jpg",
                "death": false
              },
              "Call out to rally your nearby allies.": {
                "text": "Your shout echoes through the fray, and your allies rally, ready to join the fight.",
                "background": "rally.jpg",
                "death": false
              }
            }
        },
         
        
        "Rally_Villagers": {
            "text": "You take a deep breath and step forward, seizing the moment. With authority, you shout to the villagers, “Gather behind me—now!” ",
            "choices": {
                "Direct a flank maneuver to catch the enemy off guard.": "Ambush",
                "Establish a fortified defensive line to repel the onslaught.": "Ambush",
                "Target enemy commanders to sow chaos in their ranks.": "Ambush"
        
            },
            "outcomes": {
                "Direct a flank maneuver to catch the enemy off guard.": {
                    "text": "You swiftly lead a group of villagers in a surprise flank maneuver. As you circle around, you engage a mysterious stranger whose blade meets yours in a fierce clash.",
                    "background": "battle.jpg",
                    "death": false
                },
                "Establish a fortified defensive line to repel the onslaught.": {
                    "text": "You command the villagers to form a resolute defensive line. With strategic precision, you hold the enemy at bay and deflect their relentless assault.",
                    "background": "evade.jpg",
                    "death": false
                },
                "Target enemy commanders to sow chaos in their ranks.": {
                    "text": "You focus your assault on the enemy commanders, intent on breaking their chain of command. Amid the turmoil, a lone stranger hesitates, providing you with a critical opening.",
                    "background": "talk.jpg",
                    "death": true
                }
            }
        },
        
        "Finale": {
            "text": "The enemy lies defeated and calm settles over the field. Sir Gavin rides forward, his voice ringing out, 'You fought with honor. Will you accept this recommendation for knighthood?'",
            "choices": {
              "Accept Sir Gavin's invitation.": "Trials",
              "Decline and continue on your own path.": "Finale"
            },
            "outcomes": {
              "Accept Sir Gavin's invitation.": {
                "text": "You accept the invitation. In a solemn ceremony, Sir Gavin knights you on the spot. With your new title, you ride into the future alongside your noble brothers.",
                "background": "Throne",
                "death": false
              },
              "Decline and continue on your own path.": {
                "text": "You respectfully decline, choosing to forge your own destiny. Though the knighthood passes you by, victory is yours, and your legend lives on.",
                "background": "Throne",
                "death": false
              }
            }
        },
           
           "Play_With_Thane": {
                      "text": "Play with Thane, he insists it’s a beutiful day.",
                      "choices": {
                          "Compete with Thane to see who catches the biggest fish.": "Compete_W_Thane",
                          "Lean back, close your eyes, and let the river carry your worries away.": "Relaxation_",
                          "Follow the river’s bend—something about it feels… different.": "Cuiosisty_Route"
                      },
                      "outcomes": {
                          "Compete with Thane to see who catches the biggest fish.": {
                              "text": "Laughter fills the air as you cast your lines, neither willing to admit defeat. The sun glistens on the water—just two friends, a river, and a friendly challenge.",
                              "background": "NewVillage.jpg",
                              "death": false
                          },
                          "Lean back, close your eyes, and let the river carry your worries away.": {
                              "text": "The water’s rhythm lulls you into peace. Thane sighs beside you. Days like this… he murmurs, I wish they could last forever.",
                              "background": "NewVillage.jpg",
                              "death": false
                          },
                          "Follow the river’s bend—something about it feels… different.": {
                              "text": "Curiosity pulls you downstream, where the world grows still. Then, caught in the reeds, you spot something—old, forgotten, and not meant to be found.",
                              "background": "NewVillage.jpg",
                              "death": false
                          }
                      }
                  },

                  "Compete_W_Thane": {
                      "text": "Compete with Thane to see who catches the biggest fish.",
                      "choices": {
                          "Raise the stakes—loser owes a dangerous favor.": "Dangrous_Favor",
                          "Accuse Thane of cheating, just to get a reaction.": "Cheating_",
                          "Let the contest fade—ask Thane why he really came.": "Why_Bother"
                      },
                      "outcomes": {
                          "Raise the stakes—loser owes a dangerous favor.": {
                              "text": "Thane’s smirk widens. “A favor from a knight? That’s valuable.” You fish in tense silence, both knowing the wrong request could shake Illicity’s fragile balance.",
                              "background": "NewVillage.jpg",
                              "death": false
                          },
                          "Accuse Thane of cheating, just to get a reaction.": {
                              "text": "He gasps in mock offense. “You wound me, Aldric.” Then, with a grin, he flicks water at you. “Fine. I’ll play fair... this time.”",
                              "background": "NewVillage.jpg",
                              "death": false
                          },
                          "Let the contest fade—ask Thane why he really came.": {
                              "text": "His smirk falters. He watches the river, unreadable. “Things are shifting, Aldric. The underworld is stirring. And when the shadows move, even knights should pay attention.”",
                              "background": "Newvillage.jpg",
                              "death": false
                          }
                      }
                  },
                  
                  "Why_Bother": {
                      "text": "Aldric, sensing that this competition isn't just about rivalry, steps back from the game and faces Thane directly. 'This isn't about winning, is it? Why are you really here?' Thane hesitates, then his expression shifts—this was never just about proving who was better.",
                      "choices": {
                          "Thane Confesses a Hidden Fear": "Truth_Revealed",
                          "Thane Deflects and Tests Aldric": "promotion",
                          "Thane Offers an Alliance": "Uncertain_Trust"
                      },
                      "outcomes": {
                          "Thane Confesses a Hidden Fear": {
                              "text": "Instead of answering directly, Thane turns the question back on Aldric, forcing him to examine his own choices. but gets back bitten and got killed",
                              "background": "VillageRaid.jpg",
                              "death": true
                          },
                          "Thane Deflects and Tests Aldric": {
                              "text": "Aldric shows off that he is good and a royality sees his loyality where he gets promoted",
                              "background": "Throne.jpg",
                              "death": false
                          },
                          "Thane Offers an Alliance": {
                              "text": "Thane reveals that he’s planning something risky—an escape, a rebellion, or a deception of his own.",
                              "background": "VillageRaid.jpg",
                              "death": true
                          }
                      }
                  },
                  
                  "Dangrous_Favor": {
                      "text": "Aldric enters a high-stakes wager, where failure means owing a deadly favor to a powerful individual or faction.",
                      "choices": {
                          "Cheat to win the game": "cheater_",
                          "Play fairly and lose": "Play_Fair",
                          "Refuse to pay and fight back": "Why_Bother"
                      },
                      "outcomes": {
                          "Cheat to win the game": {
                              "text": "Aldric rigs the match using trickery, such as a hidden dagger, a false deck, or bribing a witness. If he succeeds, he walks away with his life but is forever branded as dishonorable. Some allies refuse to work with him, and the person he cheated may seek revenge later. If caught, he is publicly humiliated and loses all credibility, forcing him to flee Illicity.",
                              "background": "NewVillage.jpg",
                              "death": false
                          },
                          "Play fairly and lose": {
                              "text": "Aldric plays honestly but loses, now bound to fulfill a deadly favor. The favor could be assassinating a rival, smuggling plague-tainted goods, or betraying a close ally. He now has a moral dilemma: does he honor the deal  and commit an atrocity, or refuse and face the consequences?",
                              "background": "Throne.jpg",
                              "death": false
                          },
                          "Refuse to pay and fight back": {
                              "text": "Aldric refuses to honor the wager, angering the powerful individual he bet against.He draws his sword (or attempts to escape), triggering an immediate execution or assassination. If he fights, he is outnumbered and killed on the spot, possibly making Thane or another ally a target in the aftermath.",
                              "background": "Throne.jpg",
                              "death": true
                          }
                      }
                  },
                  
                  "cheater_": {
                      "text": "Aldric cheated to win, securing victory but at a great cost—his honor is shattered, and his enemies are watching. Now, he must decide how to navigate the consequences.",
                      "choices": {
                          "Seek protection from a noble": "A_Coward",
                          "Go Suicide": "end_of_acheater",
                          "Disappear into Illicity’s underworld": "Survival"
                      },
                      "outcomes": {
                          "Seek protection from a noble": {
                              "text": "Aldric humbles himself before a royality , offering his skills in exchange for protection.",
                              "background": "Crafting.jpg",
                              "death": false
                          },
                          "Go Suicide": {
                              "text": "Aldric lost all his honor because he cheated infront of everyone and now he depressed where he killed himself with a sword.",
                              "background": "Crafting.jpg",
                              "death": true
                          },
                          "Disappear into Illicity’s underworld": {
                              "text": "Aldric vanishes from noble society, taking refuge among thieves, mercenaries, and informants.",
                              "background": "VillageRaid.jpg",
                              "death": false
                          }
                      }
                  },
                  
                  "Survival": {
                      "text": "Aldric goes to The low ground and he meets gangsters to seek protection from.",
                      "choices": {
                          "ask for protection from a gangster": "you_die",
                          "make a deal with them": "you_die",
                          "Try to sneak into their land and hide": "you_die"
                      },
                      "outcomes": {
                          "ask for protection from a gangster": {
                              "text": "They end up killing aldric because they dont trust him",
                              "background": "Crafting.jpg",
                              "death": true
                          },
                          "make a deal with them": {
                              "text": "They end up killing aldric because they dont trust him",
                              "background": "Crafting.jpg",
                              "death": true
                          },
                          "Try to sneak into their land and hide": {
                              "text": "Aldric vanishes from noble society, taking refuge among thieves, mercenaries, and informants.",
                              "background": "Crafting.jpg",
                              "death": true
                          }
                      }
                  },
                  
                  "A_Coward": {
                      "text": "Aldric is protecting a royality and now he gets promoted to a knight",
                      "choices": {
                          "A war comes and he fought to protect the royal from the raidors": "you_die",
                          "Keep getting closer to the royal to get promoted": "promotion",
                          "You make bad jokes to make the royal laugh": "you_die"
                      },
                      "outcomes": {
                          "A war comes and he fought to protect the royal from the raidors": {
                              "text": "You died because you got outnumbered by the soilders and you and the royal end up dieing.",
                              "background": "VillageRaid.jpg",
                              "death": true
                          },
                          "Keep getting closer to the royal to get promoted": {
                              "text": "You kept getting promoted where you become a noble.",
                              "background": "Throne.jpg",
                              "death": false
                          },
                          "You make bad jokes to make the royal laugh": {
                              "text": "The royal got mad and ordered the soilders to kill you.",
                              "background": "Crafting.jpg",
                              "death": true
                          }
                      }
                  },
                  
                  "promotion": {
                      "text": "Aldric got promoted to a noble",
                      "choices": {
                          "you upset the royal by loving his daughter": "you_die",
                          "you started working your way up to start getting paid more money": "money",
                          "You didnt meet the requirement of a noble so they kill you because you have a lot of information about them": "you_die"
                      },
                      "outcomes": {
                          "you upset the royal by loving his daughter": {
                              "text": "You died because you got outnumbered by the royal soilders.",
                              "background": "Crafting.jpg",
                              "death": true
                          },
                          "you started working your way up to start getting paid more money": {
                              "text": "You protected the royal from a bad guy.",
                              "background": "Throne.jpg",
                              "death": false
                          },
                          "You didnt meet the requirement of a noble so they kill you because you have a lot of information about them": {
                              "text": "The royal got mad and ordered the soilders to kill you.",
                              "background": "Throne.jpg",
                              "death": true
                          }
                      }
                  },
                  
                  "Relaxation_": {
                      "text": "Lean back, close your eyes, and let the river carry your worries away.",
                      "choices": {
                          "Ask Thane if he ever thinks about leaving Illicity behind.": "Thinking_",
                          "Let yourself drift too far—until something feels… off.": "something_off?",
                          "Break the silence—share a memory from your childhood.": "Do_You_Remember"
                      },
                      "outcomes": {
                          "Ask Thane if he ever thinks about leaving Illicity behind.": {
                              "text": "He chuckles, but there’s no humor in it. “A knight can ride away. A thief? The city owns me.” The river flows, but the weight of Illicity lingers.",
                              "background": "NewVillage.jpg",
                              "death": false
                          },
                          "Let yourself drift too far—until something feels… off.": {
                              "text": "A rustling in the trees. A shift in the air. Thane sits up. “We’re not alone.” The peace of the river shatters as shadows stir nearby.",
                              "background": "NewVillage.jpg",
                              "death": false
                          },
                          "Break the silence—share a memory from your childhood.": {
                              "text": "Thane listens, eyes half-lidded. “Strange,” he murmurs. “I never had days like that.” The gap between your worlds has never felt wider.",
                              "background": "castle.jpg",
                              "death": false
                          }
                      }
                  },
                  
                  "something_off?": {
                      "text": "A rustling in the trees. A shift in the air. Thane sits up. “We’re not alone.” The peace of the river shatters as shadows stir nearby.",
                      "choices": {
                          "Stay still—wait to see what happens.": "promotion",
                          "Reach for your weapon—be ready.": "promotion",
                          "Call out—who’s there?": "Reveal_Yourself"
                      },
                      "outcomes": {
                          "Stay still—wait to see what happens.": {
                              "text": "you waited and found the king and you went and saved him and got yourself promoted",
                              "background": "Throne.jpg",
                              "death": false
                          },
                          "Reach for your weapon—be ready.": {
                              "text": "you waited and found the king and you went and saved him and got yourself promoted",
                              "background": "Throne.jpg",
                              "death": false
                          },
                          "Call out—who’s there?": {
                              "text": "Your voice cuts through the air. “Who’s there?” Silence. Then—movement. Figures melt from the darkness, weapons drawn. Thane curses under his breath. “Damn it, Aldric.”",
                              "background": "dkfj.jpg",
                              "death": true
                          }
                      }
                  },
                  
                  "Do_You_Remember": {
                      "text": "Thane listens, eyes half-lidded. “Strange,” he murmurs. “I never had days like that.” The gap between your worlds has never felt wider.",
                      "choices": {
                          "Ask why—what was his childhood like": "promotion",
                          "Change the subject—keep things light.": "Deflecting_Joke",
                          "Insist—memories shape who we are.": "Compete_W_Thane"
                      },
                      "outcomes": {
                          "Ask why—what was his childhood like": {
                              "text": "He hesitates. “Not much to tell,” he finally says. But his voice is hollow. Something in his past is locked away. Something he won’t share—not yet.",
                              "background": "Throne.jpg",
                              "death": false
                          },
                          "Change the subject—keep things light.": {
                              "text": "you got off gaurd and got killed",
                              "background": "Craft.jpg",
                              "death": true
                          },
                          "Insist—memories shape who we are.": {
                              "text": "You hold his gaze. “The past shapes us, Thane.” He exhales sharply, staring at the water. For a long moment, he says nothing. Then: “Maybe that’s why I try to forget.”",
                              "background": "kdjf.jpg",
                              "death": false
                          }
                      }
                  },
                  
                  "Thinking_": {
                      "text": "Aldric asks the question, and Thane hesitates—just long enough for Aldric to know that he’s thought about it before.'And go where, Aldric?' Thane finally replies. 'The world outside isn’t any kinder. Illicity is cruel, but at least we know its rules.' But Aldric sees something in his eyes—doubt, maybe even longing. And so, the path begins.",
                      "choices": {
                          "Thane Admits He Wants to Leave.": "A_Spark_of_Hope",
                          "Thane Denies It, But Aldric Pushes": "Forcing_a_Revelation",
                          "Thane Refuses, Warning Aldric Not to Dream": "A Split in Ideals"
                      },
                      "outcomes": {
                          "Thane Admits He Wants to Leave.": {
                              "text": "Thane finally speaks the truth—he’s always wanted to leave but never thought it possible which was indeed imposible where he was killed",
                              "background": "Crafting.jpg",
                              "death": true
                          },
                          "Thane Denies It, But Aldric Pushes": {
                              "text": "Thane laughs it off, pretending he’s never thought about it.",
                              "background": "NewVillage.jpg",
                              "death": false
                          },
                          "Thane Refuses, Warning Aldric Not to Dream": {
                              "text": "Thane rejects the idea outright, warning Aldric that Illicity is all they have.",
                              "background": "castle.jpg",
                              "death": true
                          }
                      }
                  },
                  
                  "Forcing_a_Revelation": {
                      "text": "If Aldric and Thane agree to leave, they must figure out how—or if staying in Illicity is the better choice.",
                      "choices": {
                          "Earn the Favor of a Noble": "Noble_Help",
                          "Join the Knights as a Way Out": "Noble_Help",
                          "Escape as Outlaws": "Freedom"
                      },
                      "outcomes": {
                          "Earn the Favor of a Noble": {
                              "text": "If they are to leave, they’ll need money, protection, and influence. Thane suggests finding a noble sponsor, someone who can provide safe passage or political cover. This leads to working for nobles, entangling them in Illicity’s elite power struggles.",
                              "background": "Throne.jpg",
                              "death": false
                          },
                          "Join the Knights as a Way Out": {
                              "text": "Join the knights and gets noticed by nobles and got promoted for his good works",
                              "background": "Throne.jpg",
                              "death": false
                          },
                          "Escape as Outlaws": {
                              "text": "Thane rejects the idea outright, warning Aldric that Illicity is all they have.",
                              "background": "Crafting.jpg",
                              "death": true
                          }
                      }
                  },
                  
                  "Noble_Help": {
                      "text": "If Aldric and Thane agree to leave, they must figure out how—or if staying in Illicity is the better choice.",
                      "choices": {
                          "Train Under a Knight": "promotion",
                          "Join the Knights as a Way Out": "promotion",
                          "Try to kill the king": "Freedom"
                      },
                      "outcomes": {
                          "Train Under a Knight": {
                              "text": "Aldric swears fealty to a respected knight, working to earn his place.",
                              "background": "Crafting.jpg",
                              "death": false
                          },
                          "Join the Knights as a Way Out": {
                              "text": "Aldric seeks a noble patron, securing his place through strategy, alliances, and service.",
                              "background": "Throne.jpg",
                              "death": false
                          },
                          "Try to kill the king": {
                              "text": "Thane rejects the idea outright, and trying to kill the king but failed.",
                              "background": "Crafting.jpg",
                              "death": true
                          }
                      }
                  },
                  
                  "Cuiosisty_Route": {
                      "text": "Follow the river’s bend—something about it feels… different.",
                      "choices": {
                          "Push through the reeds—there’s something glinting in the water.": "Somthing_in_water",
                          "Notice the silence—no birds, no rustling, just stillness.": "Somthing_in_water",
                          "Keep walking—let curiosity lead you deeper.": "More_Curious"
                      },
                      "outcomes": {
                          "Push through the reeds—there’s something glinting in the water.": {
                              "text": "You wade in, fingers brushing metal—a rusted dagger with a noble’s crest. Thane whistles low. “That’s a problem. Or a clue.”",
                              "background": "fog.jpg",
                              "death": false
                          },
                          "Notice the silence—no birds, no rustling, just stillness.": {
                              "text": "Thane steps closer, hand near his dagger. “Feels wrong.” Then you see it—a cloak snagged on a branch, torn and bloodstained.",
                              "background": "shadow.jpg",
                              "death": false
                          },
                          "Keep walking—let curiosity lead you deeper.": {
                              "text": "Curiosity pulls you downstream, where the world grows still. Then, caught in the reeds, you spot something—old, forgotten, and not meant to be found.",
                              "background": "castle.jpg",
                              "death": false
                          }
                      }
                  },
                  
                  "More_Curious": {
                      "text": "Follow the river’s bend—something about it feels… different.",
                      "choices": {
                          "Search for signs of why this place feels so wrong.": "nothing",
                          "Call out—someone must have been here before.": "nothing",
                          "Keep moving forward—find the truth, no matter what.": "nothing"
                      },
                      "outcomes": {
                          "Search for signs of why this place feels so wrong.": {
                              "text": "The land is wrong. The river’s edge crumbles beneath your feet—except it’s not land anymore. It’s something soft, rotting, moving. Hands break free from the earth, grasping at your legs, pulling you down into the mass of shifting bodies beneath the soil. You thrash, but the more you fight, the deeper you sink. The last thing you see is Thane reaching for you—too late.",
                              "background": "Crafting.jpg",
                              "death": true
                          },
                          "Call out—someone must have been here before.": {
                              "text": "Your voice echoes too far, as if the world is stretching, warping. Then, something answers. It doesn’t speak—it fills the space where your words should have been. The silence collapses inward, a deafening, crushing force. Your ears ring, your vision darkens. Thane watches in horror as you fall to your knees, eyes blank. The thing you called heard you. And it has taken you.",
                              "background": "Crafting.jpg",
                              "death": true
                          },
                          "Keep moving forward—find the truth, no matter what.": {
                              "text": "You step forward—one step, then another, until the ground vanishes beneath you. There is no sound, no light, no air. You do not fall, but you are falling. Thane’s voice is distant, calling your name, but he is on the other side now. The place you stepped into is not made for you. And so, you cease to be.",
                              "background": "Crafting.jpg",
                              "death": true
                          }
                      }
                  },
                  
                  "Somthing_in_water": {
                      "text": "A discovery in the river—whether a rusted dagger, a bloodstained cloak, or something hidden beneath the water’s surface—changes everything.",
                      "choices": {
                          "Examine the dagger closely—who did it belong to": "Dagger_Truth",
                          "Follow the trail—the bloodstained cloak means someone was here.": "Cloak_Clues",
                          "Look beneath the water—something else is down there.": "Water_Shadow"
                      },
                      "outcomes": {
                          "Examine the dagger closely—who did it belong to": {
                              "text": "The noble’s crest is unmistakable—one of Illicity’s ruling houses. If this dagger was discarded here, someone powerful didn’t want it found.",
                              "background": "Throne.jpg",
                              "death": true
                          },
                          "Follow the trail—the bloodstained cloak means someone was here.": {
                              "text": "Thane steps closer, hand near his dagger. “Feels wrong.” Then you see it—a cloak snagged on a branch, torn and bloodstained where he gets killed.",
                              "background": "Crafting.jpg",
                              "death": true
                          },
                          "Look beneath the water—something else is down there.": {
                              "text": "You reach deeper, fingers brushing something smooth. Not metal—bone. Thane curses. “I think we just found a body.”",
                              "background": "Crafting.jpg",
                              "death": true
                          }
                      }
                  },
                  "Sparring": {
                              "text": "You need to sharpen your skills. The courtyard is the perfect place for practice.",
                              "choices": {
                                  "Practice sparring on your own.": "Practice_Sparring",
                                  "Seek advice from an elder warrior.": "Seekout_Guidance",
                                  "Challenge the village champion to push your limits further.": "Test_Strength"
                              },
                              "outcomes": {
                                  "Practice sparring on your own.": {
                                      "text": "You move through drills, each strike and parry becoming smoother. Sweat beads on your brow, but your confidence grows with every step.",
                                      "background": "Crafting.png",
                                      "death": false
                                  },
                                  "Seek advice from an elder warrior.": {
                                      "text": "Sitting by the fire, you listen to stories of past battles. You gain insight into strategy, understanding that victory is not only won by strength but by wit.",
                                      "background": "NewVillage.png",
                                      "death": false
                                  },
                                  "Challenge the village champion to push your limits further.": {
                                      "text": "You face the best fighter in Valleys. His strikes are swift and precise. You lose the match, but his advice leaves you with invaluable lessons.",
                                      "background": "Crafting.png",
                                      "death": false
                                  }
                              }
                          },
                          
                          "Practice_Sparring": {
                              "text": "The sun begins to set as you finish your drills. Your body is tired, but your skills feel sharper. You pause, considering your next step.",
                              "choices": {
                                  "Seek out Thane to share your progress.": "Seek_Thane",
                                  "Rest and tend to your gear.": "Rest_FixGear",
                                  "Push yourself further with advanced drills.": "Refine_Technique"
                              },
                              "outcomes": {
                                  "Seek out Thane to share your progress.": {
                                      "text": "He listens with a grin, reminding you that strength is nothing without purpose.",
                                      "background": "RegVillage.png",
                                      "death": false
                                  },
                                  "Rest and tend to your gear.": {
                                      "text": "The veteran accepts. Their skill pushes you to your limits. You lose the match but gain valuable lessons.",
                                      "background": "NewVillage.png",
                                      "death": false
                                  },
                                  "Push yourself further with advanced drills.": {
                                      "text": "Your skill sharpens, but fatigue leaves you sore and exhausted.",
                                      "background": "Crafting.png",
                                      "death": false
                                  }
                              }
                          },
                          
                          "Seek_Thane": {
                              "text": "You find Thane tinkering with gears and scraps. He lights up at your arrival, always glad for your company. The two of you talk—dreams of the future, worries about the village—until the sun dips lower.",
                              "choices": {
                                  "Help Thane test his latest invention.": "Help_Thane",
                                  "Train with Thane using wooden swords.": "Train_WithThane",
                                  "Discuss rumors of unrest beyond the village.": "Discuss_Rumors"
                              },
                              "outcomes": {
                                  "Help Thane test his latest invention.": {
                                      "text": "Sparks fly, and gears jam, but together you make progress. Thane’s eyes gleam with excitement—you’re part of something bigger.",
                                      "background": "cliff.jpg",
                                      "death": false
                                  },
                                  "Train with Thane using wooden swords.": {
                                      "text": "The spar is lighthearted, but you both improve. Each clash of wood sharpens your bond and your reflexes.",
                                      "background" : "jump.jpg",
                                      "death": false
                                  },
                                  "Discuss rumors of unrest beyond the village.": {
                                      "text": "Thane grows serious. He’s heard whispers of raiders—trouble may be closer than you thought.",
                                      "background": "NewVillage.png",
                                      "death": false
                                  }
                              }
                          },
                          
                          "Help_Thane": {
                              "text": "You and Thane work side by side, adjusting gears and tightening bolts. His latest invention—a small device meant to carry fire safely—flickers to life. Thane grins, proud, but you both know his ideas are often risky.",
                              "choices": {
                                  "Push Thane’s invention further, testing its limits.": "Push_Invention",
                                  "Celebrate the small success and head home.": "Celebrate_Home",
                                  "Convince Thane to show his work to the village elder.": "Celebrate_Home"
                              },
                              "outcomes": {
                                  "Push Thane’s invention further, testing its limits.": {
                                      "text": "Flames roar unexpectedly. The device explodes. You and Thane are not so lucky. Both your lifeless body lies beside twisted metal. The world feels colder without you guys.",
                                      "background": "VillageRaid.png",
                                      "death": true
                                  },
                                  "Celebrate the small success and head home.": {
                                      "text": "You both laugh, proud of your progress. As the sun sets, you walk home together, feeling like anything is possible.",
                                      "background": "NewVillage.png",
                                      "death": false
                                  },
                                  "Convince Thane to show his work to the village elder.": {
                                      "text": "The elder is skeptical but impressed. Thane gains recognition—his ideas may shape the future of Valleys.",
                                      "background": "NewVillage.png",
                                      "death": false
                                  }
                              }
                          },
                          
                          "Celebrate_Home": {
                              "text": " On your way you see barbarians are storming the village, pick up a weapon to defend yourself!.",
                              "choices": {
                                  "Sword": "Honor_Fight",
                                  "Mace": "Black_Mace",
                                  "Red spear": "Red_Spear"
                              },
                              "outcomes": {
                                  "Sword": {
                                      "text": "You’re able to quickly pick up the sword and block the incoming attack, you save the village with thane pushing back the enemies",
                                      "background": "FireCity.png",
                                      "death": false
                                  },
                                  "Mace": {
                                      "text": "You manage to swing the heavy mace to deflect the barbarians but you are not used to battling with a mace and it got to heavy for you.",
                                      "background": "jump.jpg",
                                      "death": true
                                  },
                                  "Red spear": {
                                      "text": "It holds well in hand however, it’s too long to defend yourself quick enough from the barbarians. They get too close before you can use it properly and they smash your head in.",
                                      "background": "fog.jpg",
                                      "death": true
                                  }
                              }
                          },
                          
                          "Rest_FixGear": {
                             "text": "You carefully maintain your weapon and armor. Your hands move with precision as you restore your gear to pristine condition.",
                             "choices": {
                                 "Join the village watch for the evening patrol.": "Evening_Patrol",
                                 "Return home and rest for the night.": "Rest_At_Home",
                                 "Visit Thane to see his latest work.": "Seek_Thane"
                             },
                             "outcomes": {
                                 "Join the village watch for the evening patrol.": {
                                     "text": "The cool night air sharpens your senses as you walk the perimeter with the guards.",
                                     "background": "NewVillage.png",
                                     "death": false
                                 },
                                 "Return home and rest for the night.": {
                                     "text": "You wake refreshed, ready to face the day ahead.",
                                     "background": "City.png",
                                     "death": false
                                 },
                                 "Visit Thane to see his latest work.": {
                                     "text": "Thane welcomes you eagerly, showing his newest creation.",
                                     "background": "RegVillage.png",
                                     "death": false
                                 }
                             }
                         },
                                 "Refine_Technique": {
                                     "text": "Your muscles ache as you push your body to the limit. Each swing becomes sharper, more precise.",
                                     "choices": {
                                         "Challenge a fellow villager to a friendly duel.": "Friendly_Duel",
                                         "Test your skills against multiple training dummies.": "Training_Dummies",
                                         "Take a break and seek guidance from Sir Gavain.": "Talk_To_Gavain"
                                     },
                                     "outcomes": {
                                         "Challenge a fellow villager to a friendly duel.": {
                                             "text": "You exchange blows with a friend, learning valuable lessons.",
                                             "background": "Crafting.png",
                                             "death": false
                                         },
                                         "Test your skills against multiple training dummies.": {
                                             "text": "Sweat pours down as you maneuver swiftly between the dummies, honing your reflexes.",
                                             "background": "Crafting.png",
                                             "death": false
                                         },
                                         "Take a break and seek guidance from Sir Gavain.": {
                                             "text": "Sir Gavain shares his wisdom, hinting at greater things ahead.",
                                             "background": "castle.jpg",
                                             "death": false
                                         }
                                     }
                                 },

                                 "Evening_Patrol": {
                                                    "text": "The village is quiet, but your instincts warn you of dangers beyond the treeline.",
                                                    "choices": {
                                                        "Investigate strange sounds from the forest.": "Forest_Scouting",
                                                        "Hold your position and watch carefully.": "Hold_Position",
                                                        "Return to the village to report potential threats.": "Report_Threats"
                                                    },
                                                    "outcomes": {
                                                        "Investigate strange sounds from the forest.": {
                                                            "text": "A group of raiders ambush you—despite your bravery, you are overwhelmed.",
                                                            "background": "RegVillage.png",
                                                            "death": true
                                                        },
                                                        "Hold your position and watch carefully.": {
                                                            "text": "The sounds fade into the night. You remain vigilant, earning the attention of Sir Gavain for your discipline.",
                                                            "background": "cliff.jpg",
                                                            "death": false
                                                        },
                                                        "Return to the village to report potential threats.": {
                                                            "text": "Your warning prepares the village for danger, and Sir Gavain takes notice of your initiative.",
                                                            "background": "NewVillage.png",
                                                            "death": false
                                                        }
                                                    }
                                                },


                                 "Rest_At_Home": {
                                     "text": "You rest peacefully, but your mind is troubled with thoughts of what’s to come.",
                                     "choices": {
                                         "Wake early to train before dawn.": "Refine_Technique",
                                         "Seek out Sir Gavain in the morning.": "Talk_To_Gavain",
                                         "Check on Thane and his work.": "Seek_Thane"
                                     },
                                     "outcomes": {
                                         "Wake early to train before dawn.": {
                                             "text": "The sun rises as you practice, each swing cutting through the crisp air.",
                                             "background": "Crafting.png",
                                             "death": false
                                         },
                                         "Seek out Sir Gavain in the morning.": {
                                             "text": "Sir Gavain welcomes you, discussing your future as a warrior.",
                                             "background": "castle.jpg",
                                             "death": false
                                         },
                                         "Check on Thane and his work.": {
                                             "text": "Thane is eager to show you his latest ideas.",
                                             "background": "RegVillage.png",
                                             "death": false
                                         }
                                     }
                                 },

                                 "Friendly_Duel": {
                                     "text": "You duel a close friend. The match is intense, but you both laugh as it ends.",
                                     "choices": {
                                         "Celebrate together over drinks.": "Celebrate_With_Friend",
                                         "Challenge the village champion.": "Test_Strength",
                                         "Speak to Sir Gavain about knighthood.": "Talk_To_Gavain"
                                     },
                                     "outcomes": {
                                         "Celebrate together over drinks.": {
                                             "text": "The bond of friendship strengthens, but you overhear troubling rumors of raiders.",
                                             "background": "City.png",
                                             "death": false
                                         },
                                         "Challenge the village champion.": {
                                             "text": "The champion respects your bravery, regardless of the result.",
                                             "background": "Crafting.png",
                                             "death": false
                                         },
                                         "Speak to Sir Gavain about knighthood.": {
                                             "text": "Sir Gavain admires your drive, seeing potential in you.",
                                             "background": "castle.jpg",
                                             "death": false
                                         }
                                     }
                                 },

                                 "Training_Dummies": {
                                                    "text": "You push yourself hard, your body aching with effort.",
                                                    "choices": {
                                                        "Seek healing from the village herbalist.": "Visit_Herbalist",
                                                        "Rest and evaluate your progress.": "Rest_At_Home",
                                                        "Test yourself against a group spar.": "Group_Spar"
                                                    },
                                                    "outcomes": {
                                                        "Seek healing from the village herbalist.": {
                                                            "text": "The herbalist eases your pain. You feel ready for more, and your dedication reaches Sir Gavain’s ears.",
                                                            "background": "NewVillage.png",
                                                            "death": false
                                                        },
                                                        "Rest and evaluate your progress.": {
                                                            "text": "You reflect on your growth, feeling more prepared. Sir Gavain hears of your diligence.",
                                                            "background": "City.png",
                                                            "death": false
                                                        },
                                                        "Test yourself against a group spar.": {
                                                            "text": "You hold your own, earning the respect of your peers. Sir Gavain notes your progress.",
                                                            "background": "Regvillage.png",
                                                            "death": false
                                                        }
                                                    }
                                                },
                                 
                                 "Seekout_Guidance": {
                                             "text": "You sit beside the elder warrior by the fire. He speaks of battles fought and lessons learned.",
                                             "choices": {
                                                 "Take his advice and practice what you learned.": "Practice_Sparring",
                                                 "Ask him about the future and knighthood.": "Talk_To_Gavain",
                                                 "Challenge him to a friendly spar to test his wisdom.": "Elder_Spar"
                                             },
                                             "outcomes": {
                                                 "Take his advice and practice what you learned.": {
                                                     "text": "His words resonate with you. You drill his techniques until they feel natural.",
                                                     "background": "Regvillage..png",
                                                     "death": false
                                                 },
                                                 "Ask him about the future and knighthood.": {
                                                     "text": "The elder hints that Sir Gavain sees potential in you, but warns the path will be hard.",
                                                     "background": "castle.jpg",
                                                     "death": false
                                                 },
                                                 "Challenge him to a friendly spar to test his wisdom.": {
                                                     "text": "The elder bests you swiftly but praises your bravery. You walk away wiser.",
                                                     "background": "fog.jpg",
                                                     "death": false
                                                 }
                                             }
                                         },

                                 "Test_Strength": {
                                                          "text": "You step into the ring to face the village champion. The crowd watches closely.",
                                                            "choices": {
                                                                "Fight defensively, waiting for an opening.": "Defensive_Fight",
                                                                "Attack aggressively, proving your strength.": "Aggressive_Fight",
                                                                "Fight recklessly, risking everything for glory.": "Reckless_Fight"
                                                            },
                                                            "outcomes": {
                                                                "Fight defensively, waiting for an opening.": {
                                                                    "text": "Your patience pays off. You last longer than most, earning respect. Sir Gavain notices your composure and extends an invitation.",
                                                                    "background": "cliff.jpg",
                                                                    "death": false
                                                                },
                                                                "Attack aggressively, proving your strength.": {
                                                                    "text": "Your strength impresses, but the champion overwhelms you in the end. Sir Gavain sees your potential and calls you aside.",
                                                                    "background": "jump.jpg",
                                                                    "death": false
                                                                },
                                                                "Fight recklessly, risking everything for glory.": {
                                                                    "text": "You push too hard. A fatal blow leaves you lifeless in the dirt. Your ambition ends here.",
                                                                    "background": "fog.jpg",
                                                                    "death": true
                                                                }
                                                            }
                                                        },

                                          "Elder_Spar": {
                                                       "text": "You and the elder warrior circle each other, weapons raised.",
                                                       "choices": {
                                                           "Fight with honor and restraint.": "Honor_Fight",
                                                           "Try to outsmart him with clever moves.": "Clever_Fight",
                                                           "Lose your temper and attack wildly.": "Wild_Fight"
                                                       },
                                                       "outcomes": {
                                                           "Fight with honor and restraint.": {
                                                               "text": "The elder respects your discipline. He recommends you to Sir Gavain for the Knighthood Trial.",
                                                               "background": "cliff.jpg",
                                                               "death": false
                                                           },
                                                           "Try to outsmart him with clever moves.": {
                                                               "text": "Your cleverness surprises him, but his experience wins out. He suggests you speak with Sir Gavain about your future.",
                                                               "background": "jump.jpg",
                                                               "death": false
                                                           },
                                                           "Lose your temper and attack wildly.": {
                                                               "text": "Your rage blinds you. The elder strikes you down. You do not rise.",
                                                               "background": "fog.jpg",
                                                               "death": true
                                                           }
                                                       }
                                                   },

                                         "Talk_To_Gavain": {
                                             "text": "You approach Sir Gavain, his gaze sharp as he observes your progress.",
                                             "choices": {
                                                 "Ask for advice on knighthood.": "Knight_Advice",
                                                 "Request to train under him directly.": "Train_Under_Gavain",
                                                 "Challenge him to test your skill.": "Challenge_Gavain"
                                             },
                                             "outcomes": {
                                                 "Ask for advice on knighthood.": {
                                                     "text": "Gavain speaks of honor, courage, and the trials ahead. He believes you have potential.",
                                                     "background": "City.png",
                                                     "death": false
                                                 },
                                                 "Request to train under him directly.": {
                                                     "text": "Gavain accepts, but warns the training will be brutal. You begin the journey.",
                                                     "background": "Crafting.png",
                                                     "death": false
                                                 },
                                                 "Challenge him to test your skill.": {
                                                     "text": "You are no match. Gavain bests you swiftly but admires your boldness.",
                                                     "background": "Crafting.png",
                                                     "death": false
                                                 }
                                             }
                                         },

                                         "Knight_Advice": {
                                             "text": "Gavain’s words linger in your mind as you consider your future.",
                                             "choices": {
                                                 "Focus on mastering your combat skills.": "Practice_Sparring",
                                                 "Learn more about court politics and leadership.": "Court_Study",
                                                 "Commit yourself to protecting the weak.": "Protect_Weak"
                                             },
                                             "outcomes": {
                                                 "Focus on mastering your combat skills.": {
                                                     "text": "Your blade becomes an extension of your will. Each day, you grow stronger.",
                                                     "background": "Regvillage.png",
                                                     "death": false
                                                 },
                                                 "Learn more about court politics and leadership.": {
                                                     "text": "You study the ways of nobles, realizing battles are often fought with words.",
                                                     "background": "NewVillage.png",
                                                     "death": false
                                                 },
                                                 "Commit yourself to protecting the weak.": {
                                                     "text": "Your heart swells with purpose. The villagers begin to see you as their shield.",
                                                     "background": "jump.jpg",
                                                     "death": false
                                                 }
                                             }
                                         },

                                         "Court_Study": {
                                             "text": "The halls of the nobles are full of whispers and schemes. You observe carefully.",
                                             "choices": {
                                                 "Gain favor with a noble family.": "Noble_Favor",
                                                 "Expose corruption you discover.": "Expose_Corruption",
                                                 "Keep your head down and observe silently.": "Silent_Observer"
                                             },
                                             "outcomes": {
                                                 "Gain favor with a noble family.": {
                                                     "text": "A powerful lord takes notice of you, but his favor comes with strings.",
                                                     "background": "Throne.png",
                                                     "death": false
                                                 },
                                                 "Expose corruption you discover.": {
                                                     "text": "Your bravery earns you enemies. One night, you are found with a dagger in your chest.",
                                                     "background": "fog.jpg",
                                                     "death": true
                                                 },
                                                 "Keep your head down and observe silently.": {
                                                     "text": "Knowledge becomes your weapon. You learn who holds true power.",
                                                     "background": "Throne.png",
                                                     "death": false
                                                 }
                                             }
                                         },
                                         
                                         "Hold_Position": {
                                                            "text": "Your vigilance has earned Sir Gavain’s respect. He approaches you with a proposition.",
                                                            "choices": {
                                                                "Listen to Gavain’s proposal.": "Decision_8"
                                                            },
                                                            "outcomes": {
                                                                "Listen to Gavain’s proposal.": {
                                                                    "text": "Sir Gavain invites you to undergo the Knighthood Trial.",
                                                                    "background": "Crafting.png",
                                                                    "death": false
                                                                }
                                                            }
                                                        },

                                                        "Report_Threats": {
                                                            "text": "Your quick thinking has not gone unnoticed. Sir Gavain calls you aside the next day.",
                                                            "choices": {
                                                                "Answer Gavain’s summons.": "Decision_8"
                                                            },
                                                            "outcomes": {
                                                                "Answer Gavain’s summons.": {
                                                                    "text": "Sir Gavain offers you a chance to prove yourself in the Knighthood Trial.",
                                                                    "background": "castle.jpg",
                                                                    "death": false
                                                                }
                                                            }
                                                        },
                                                        
                                                        "Visit_Herbalist": {
                                                                          "text": "The herbalist provides you with a rare tonic. You feel revitalized.",
                                                                          "choices": {
                                                                              "Offer to guard her on her forest gathering trip.": "Forest_Guard",
                                                                              "Return to training after recovery.": "Refine_Technique",
                                                                              "Seek Sir Gavain’s advice on your future.": "Talk_To_Gavain"
                                                                          },
                                                                          "outcomes": {
                                                                              "Offer to guard her on her forest gathering trip.": {
                                                                                  "text": "Bandits attack during the trip. You fight bravely but fall in battle.",
                                                                                  "background": "VillageRaid.png",
                                                                                  "death": true
                                                                              },
                                                                              "Return to training after recovery.": {
                                                                                  "text": "With renewed strength, you hone your skills further, gaining recognition from Sir Gavain.",
                                                                                  "background": "cliff.jpg",
                                                                                  "death": false
                                                                              },
                                                                              "Seek Sir Gavain’s advice on your future.": {
                                                                                  "text": "Sir Gavain speaks of knighthood and the responsibilities it carries. He invites you to the Knighthood Trial.",
                                                                                  "background": "castle.jpg",
                                                                                  "death": false
                                                                              }
                                                                          }
                                                                      },

                                                                      "Group_Spar": {
                                                                          "text": "After the group spar, your skill has caught Sir Gavain’s attention.",
                                                                          "choices": {
                                                                              "Accept Sir Gavain’s invitation.": "Decision_8"
                                                                          },
                                                                          "outcomes": {
                                                                              "Accept Sir Gavain’s invitation.": {
                                                                                  "text": "Sir Gavain invites you to undergo the Knighthood Trial.",
                                                                                  "background": "castle.jpg",
                                                                                  "death": false
                                                                              }
                                                                          }
                                                                      },

                                                                      "Decision_8": {
                                                                          "text": "Sir Gavain nominates you for knighthood. You must choose your trial.",
                                                                          "choices": {
                                                                              "Duel to the death against a seasoned knight.": "Duel_Death",
                                                                              "Undergo a series of chivalric tests.": "Chivalric_Tests",
                                                                              "Volunteer for a dangerous quest.": "Dangerous_Quest"
                                                                          },
                                                                          "outcomes": {
                                                                              "Duel to the death against a seasoned knight.": {
                                                                                  "text": "The veteran knight fights dirty. You suffer fatal wounds.",
                                                                                  "background": "Crafting.png",
                                                                                  "death": true
                                                                              },
                                                                              "Undergo a series of chivalric tests.": {
                                                                                  "text": "You complete the tests. The nobles begrudgingly accept your integrity.",
                                                                                  "background": "Throne.png",
                                                                                  "death": false
                                                                              },
                                                                              "Volunteer for a dangerous quest.": {
                                                                                  "text":
                                                                                  "The quest proves fatal. Sir Gavain waits long after you are gone.",
                                                                                  "background": "NewVillage.png",
                                                                                  "death": true
                                                                          }
                                                                      }
                                                                  },
                      
                                              "Defensive_Fight": {
                                                 "text": "Sir Gavain approaches you after witnessing your disciplined display.",
                                                 "choices": {
                                                     "Accept his invitation to the Knighthood Trial.": "Decision_8"
                                                 },
                                                 "outcomes": {
                                                     "Accept his invitation to the Knighthood Trial.": {
                                                         "text": "Sir Gavain nominates you for knighthood. You must choose your trial.",
                                                         "background": "castle.jpg",
                                                         "death": false
                                                     }
                                                 }
                                             },
                                          
                                              "Aggressive_Fight": {
                                                                    "text": "Sir Gavain is impressed by your raw strength and invites you to prove yourself further.",
                                                                    "choices": {
                                                                        "Accept his invitation to the Knighthood Trial.": "Decision_8"
                                                                    },
                                                                    "outcomes": {
                                                                        "Accept his invitation to the Knighthood Trial.": {
                                                                            "text": "Sir Gavain nominates you for knighthood. You must choose your trial.",
                                                                            "background": "castle.jpg",
                                                                            "death": false
                                                                        }
                                                                    }
                                                                },
                                              
                                              "Honor_Fight": {
                                                                        "text": "The elder introduces you to Sir Gavain the next day.",
                                                                        "choices": {
                                                                            "Accept Sir Gavain’s invitation to the Knighthood Trial.": "Decision_8"
                                                                        },
                                                                        "outcomes": {
                                                                            "Accept Sir Gavain’s invitation to the Knighthood Trial.": {
                                                                                "text": "Sir Gavain nominates you for knighthood. You must choose your trial.",
                                                                                "background": "castle.jpg",
                                                                                "death": false
                                                                            }
                                                                        }
                                                                    },
                                              
                                              "Clever_Fight": {
                                                                        "text": " Because of your efforts, The elder suggests you seek out Sir Gavain for greater challenges.",
                                                                        "choices": {
                                                                            "Speak with Sir Gavain about your future.": "Talk_To_Gavain"
                                                                        },
                                                                        "outcomes": {
                                                                            "Speak with Sir Gavain about your future.": {
                                                                                "text": "Sir Gavain speaks with you about your potential and invites you to the Knighthood Trial.",
                                                                                "background": "castle.jpg",
                                                                                "death": false
                                                                            }
                                                                        }
                                                                    },
                                              
                                              "Protect_Weak": {
                                                  "text": "Your heart swells with purpose. The villagers begin to see you as their shield.",
                                                  "choices": {
                                                      "Accept recognition from Sir Gavain.": "Decision_8"
                                                  },
                                                  "outcomes": {
                                                      "Accept recognition from Sir Gavain.": {
                                                          "text": "Sir Gavain acknowledges your selflessness and offers you a place in the Knighthood Trial.",
                                                          "background": "castle.jpg",
                                                          "death": false
                                                      }
                                                  }
                                              },
                                              
                                              "Silent_Observer": {
                                                  "text": "Knowledge becomes your weapon. You learn who holds true power.",
                                                  "choices": {
                                                      "Share your insights with Sir Gavain.": "Talk_To_Gavain"
                                                  },
                                                  "outcomes": {
                                                      "Share your insights with Sir Gavain.": {
                                                          "text": "Sir Gavain values your understanding of the noble court and offers you a place in the Knighthood Trial.",
                                                          "background": "castle.jpg",
                                                          "death": false
                                                      }
                                                  }
                                              },
                                              
                                              "Noble_Favor": {
                                                  "text": "A powerful lord takes notice of you, but his favor comes with strings.",
                                                  "choices": {
                                                      "Leverage this favor to seek knighthood.": "Decision_8"
                                                  },
                                                  "outcomes": {
                                                      "Leverage this favor to seek knighthood.": {
                                                          "text": "Your connections open a path, and Sir Gavain formally nominates you for knighthood.",
                                                          "background": "Throne.png",
                                                          "death": false
                                                      }
                                                  }
                                              },
                                              
                                              "Chivalric_Tests": {
                                                  "text": "Your chivalric tests push your body and mind to the limit. You emerge stronger, but the nobility is still wary of you.",
                                                  "choices": {
                                                      "Seek favor with a noble family to solidify your position.": "Seek_Noble_Favor",
                                                      "Earn the people's trust through charity and good deeds.": "Gain_People_Trust",
                                                      "Prove your strength once more in a public tournament.": "Public_Tournament"
                                                  },
                                                  "outcomes": {
                                                      "Seek favor with a noble family to solidify your position.": {
                                                          "text": "A noble house offers tentative support, though their motives are unclear.",
                                                          "background": "Throne.png",
                                                          "death": false
                                                      },
                                                      "Earn the people's trust through charity and good deeds.": {
                                                          "text": "The villagers begin to look to you as their protector.",
                                                          "background": "NewVillage.png",
                                                          "death": false
                                                      },
                                                      "Prove your strength once more in a public tournament.": {
                                                          "text": "Your skill impresses the crowd and nobles alike, though rivals grow envious.",
                                                          "background": "Crafting.png",
                                                          "death": false
                                                      }
                                                  }
                                              },

                                              "Seek_Noble_Favor": {
                                                  "text": "Your alliance with the nobles grants you influence, but their demands grow heavier.",
                                                  "choices": {
                                                      "Continue appeasing the nobles to maintain power.": "Noble_Control",
                                                      "Try to balance noble demands with helping the people.": "Balance_Power",
                                                      "Distance yourself and seek independence.": "Seek_Independence"
                                                  },
                                                  "outcomes": {
                                                      "Continue appeasing the nobles to maintain power.": {
                                                          "text": "You rise in rank, but rumors paint you as a puppet of the elite.",
                                                          "background": "Throne.png",
                                                          "death": false
                                                      },
                                                      "Try to balance noble demands with helping the people.": {
                                                          "text": "You walk a dangerous line. Both sides watch your every move.",
                                                          "background": "Throne.png",
                                                          "death": false
                                                      },
                                                      "Distance yourself and seek independence.": {
                                                          "text": "You lose noble favor but gain respect from the people.",
                                                          "background": "RegVillage.png",
                                                          "death": false
                                                      }
                                                  }
                                              },

                                              "Gain_People_Trust": {
                                                  "text": "The villagers see you as their champion. However, the nobles grow uneasy with your popularity. The weight of leadership grows heavier as the plague worsens.",
                                                  "choices": {
                                                      "Lean into your role as the people's protector.": "People_Champion",
                                                      "Reassure the nobles of your loyalty.": "Reassure_Nobles",
                                                      "Seek to unite both factions under your leadership.": "Unite_Factions"
                                                  },
                                                  "outcomes": {
                                                      "Lean into your role as the people's protector.": {
                                                          "text": "The villagers adore you, but whispers of rebellion reach your ears. Sir Gavain urges you to prepare for the nobles' next demand. Food shortages strain the slums.",
                                                          "background": "NewVillage.png",
                                                          "death": false
                                                      },
                                                      "Reassure the nobles of your loyalty.": {
                                                          "text": "The nobles relax their scrutiny, though the villagers grow wary. As tensions grow, the nobles summon you to discuss quarantine plans. The streets grow quieter as fear grips the city.",
                                                          "background": "Throne.png",
                                                          "death": false
                                                      },
                                                      "Seek to unite both factions under your leadership.": {
                                                          "text": "Your vision inspires some, but others plot against you. Word comes that the plague is spreading rapidly, and the nobles summon you. There are whispers of rioting in the outskirts.",
                                                          "background": "meeting.jpg",
                                                          "death": false
                                                      }
                                                  }
                                              },

                                              "Public_Tournament": {
                                                  "text": "The tournament draws contenders from across the realm. Victory could cement your status. Yet, the specter of the plague looms even over the grandstands.",
                                                  "choices": {
                                                      "Fight honorably and showcase your skill.": "Honor_Victory",
                                                      "Use cunning tactics to secure a win.": "Cunning_Victory",
                                                      "Take a risk and challenge the champion directly.": "Challenge_Champion"
                                                  },
                                                  "outcomes": {
                                                      "Fight honorably and showcase your skill.": {
                                                          "text": "You win the crowd’s favor, though the nobles remain skeptical. Rumors of the plague’s spread within the tournament crowd reach your ears.",
                                                          "background": "Crafting.png",
                                                          "death": false
                                                      },
                                                      "Use cunning tactics to secure a win.": {
                                                          "text": "You prevail, but whispers accuse you of dishonor. A noble falls ill shortly after shaking your hand.",
                                                          "background": "Crafting.png",
                                                          "death": false
                                                      },
                                                      "Take a risk and challenge the champion directly.": {
                                                          "text": "You defeat the champion in a stunning upset, earning admiration and envy. Yet, a servant in the champion’s retinue collapses with fever.",
                                                          "background": "Crafting.png",
                                                          "death": false
                                                      }
                                                  }
                                              },

                                              "People_Champion": {
                                                  "text": "Your growing influence among the people threatens the nobility. Famine and sickness grip the slums, and your presence is a rare beacon of hope.",
                                                  "choices": {
                                                      "Distribute food from noble storehouses.": "Decision_11",
                                                      "Organize the healthy to aid the sick.": "Decision_11",
                                                      "Lead public prayers for unity and strength.": "Decision_11"
                                                  },
                                                  "outcomes": {
                                                      "Distribute food from noble storehouses.": {
                                                          "text": "The villagers rally behind you, but nobles call you a thief. You are summoned to answer for your defiance.",
                                                          "background": "NewVillage.png",
                                                          "death": false
                                                      },
                                                      "Organize the healthy to aid the sick.": {
                                                          "text": "Your leadership brings brief relief, but some volunteers fall ill. The nobles grow restless and call for drastic action.",
                                                          "background": "NewVillage.png",
                                                          "death": false
                                                      },
                                                      "Lead public prayers for unity and strength.": {
                                                          "text": "Faith lifts spirits, but it does little to stop the spread. Nobles view your actions as an incitement to revolt.",
                                                          "background": "NewVillage.png",
                                                          "death": false
                                                      }
                                                  }
                                              },

                                              "Reassure_Nobles": {
                                                  "text": "Your reassurance eases tensions, but the plague continues to spread. Nobles seek scapegoats, while the common folk suffer in silence.",
                                                  "choices": {
                                                      "Increase patrols to maintain order.": "Decision_11",
                                                      "Enforce price controls on vital supplies.": "Decision_11",
                                                      "Offer personal aid to noble families.": "Decision_11"
                                                  },
                                                  "outcomes": {
                                                      "Increase patrols to maintain order.": {
                                                          "text": "The streets grow quieter, but fear and resentment simmer beneath the surface.",
                                                          "background": "City.png",
                                                          "death": false
                                                      },
                                                      "Enforce price controls on vital supplies.": {
                                                          "text": "Merchants bristle at your interference. Nobles praise you, but famine grips the slums.",
                                                          "background": "City.png",
                                                          "death": false
                                                      },
                                                      "Offer personal aid to noble families.": {
                                                          "text": "Your kindness earns favor, but the villagers see you as a traitor. You are summoned to explain your loyalties.",
                                                          "background": "City.png",
                                                          "death": false
                                                      }
                                                  }
                                              },

                                              "Unite_Factions": {
                                                  "text": "Your attempts to unify the people and nobles create fragile alliances as the plague worsens. Every step forward seems to stir more distrust.",
                                                  "choices": {
                                                      "Host joint meetings between nobles and village elders.": "Decision_11",
                                                      "Organize cooperative relief efforts.": "Decision_11",
                                                      "Deliver an impassioned speech to rally unity.": "Decision_11"
                                                  },
                                                  "outcomes": {
                                                      "Host joint meetings between nobles and village elders.": {
                                                          "text": "Some progress is made, but tempers flare and old grudges resurface.",
                                                          "background": "NewVillage.png",
                                                          "death": false
                                                      },
                                                      "Organize cooperative relief efforts.": {
                                                          "text": "The relief effort brings brief hope, but accusations of favoritism arise.",
                                                          "background": "meeting.jpg",
                                                          "death": false
                                                      },
                                                      "Deliver an impassioned speech to rally unity.": {
                                                          "text": "Your speech stirs hearts, but behind closed doors, nobles whisper of your growing power.",
                                                          "background": "meeting.jpg",
                                                          "death": false
                                                      }
                                                  }
                                              },
                                              
                                              "Honor_Victory": {
                                                  "text": "The plague begins creeping into the city following the tournament. Your newfound popularity gives you influence, but the city is fearful.",
                                                  "choices": {
                                                      "Use your prestige to aid the sick.": "Decision_11",
                                                      "Meet with nobles to address the growing crisis.": "Decision_11",
                                                      "Strengthen defenses in case unrest breaks out.": "Decision_11"
                                                  },
                                                  "outcomes": {
                                                      "Use your prestige to aid the sick.": {
                                                          "text": "Your efforts ease suffering but put you at odds with the nobles' quarantine plans.",
                                                          "background": "aid.jpg",
                                                          "death": false
                                                      },
                                                      "Meet with nobles to address the growing crisis.": {
                                                          "text": "The nobles welcome your voice, but they demand severe quarantines.",
                                                          "background": "castle.jpg",
                                                          "death": false
                                                      },
                                                      "Strengthen defenses in case unrest breaks out.": {
                                                          "text": "Order is maintained, but the slums suffer as illness spreads unchecked.",
                                                          "background": "guard.jpg",
                                                          "death": false
                                                      }
                                                  }
                                              },

                                              "Cunning_Victory": {
                                                  "text": "Your sly victory at the tournament sparks controversy. Some nobles approve, while others eye you with distrust. The plague tightens its grip.",
                                                  "choices": {
                                                      "Offer assistance to nobles affected by the plague.": "Decision_11",
                                                      "Donate your winnings to fund relief efforts.": "Decision_11",
                                                      "Quietly investigate rumors of foul play in the tournament.": "Decision_11"
                                                  },
                                                  "outcomes": {
                                                      "Offer assistance to nobles affected by the plague.": {
                                                          "text": "Your favor with the nobles grows, but they expect loyalty when quarantine talks arise.",
                                                          "background": "castle.jpg",
                                                          "death": false
                                                      },
                                                      "Donate your winnings to fund relief efforts.": {
                                                          "text": "Your generosity earns praise from the common folk, but nobles grumble about defiance.",
                                                          "background": "aid.jpg",
                                                          "death": false
                                                      },
                                                      "Quietly investigate rumors of foul play in the tournament.": {
                                                          "text": "You discover bribery among the nobles. You hold leverage, but the plague worsens, forcing your hand toward more urgent matters.",
                                                          "background": "shadow.jpg",
                                                          "death": false
                                                      }
                                                  }
                                              },

                                              "Challenge_Champion": {
                                                  "text": "Your shocking victory over the champion stirs excitement, but you also inherit his enemies. The plague infiltrates the city's walls.",
                                                  "choices": {
                                                      "Use your fame to rally the people.": "Decision_11",
                                                      "Forge alliances with rival nobles.": "Decision_11",
                                                      "Rest and recover from your injuries.": "Decision_11"
                                                  },
                                                  "outcomes": {
                                                      "Use your fame to rally the people.": {
                                                          "text": "The commoners look to you for guidance as plague spreads, but nobles grow wary of your influence.",
                                                          "background": "village.jpg",
                                                          "death": false
                                                      },
                                                      "Forge alliances with rival nobles.": {
                                                          "text": "You gain new allies, but the price is loyalty when they push for slum quarantines.",
                                                          "background": "castle.jpg",
                                                          "death": false
                                                      },
                                                      "Rest and recover from your injuries.": {
                                                          "text": "Your strength returns, but you awake to news that the nobles are moving to seal the slums.",
                                                          "background": "rest.jpg",
                                                          "death": false
                                                      }
                                                  }
                                              },


                                              "Decision_11": {
                                                  "text": "The plague worsens. Frightened nobles demand Aldric enforce strict quarantines on the slums, hoping to protect themselves.",
                                                  "choices": {
                                                      "Obey the nobles, quarantining the slums with harsh measures.": "Quarantine_Slums",
                                                      "Quietly allow aid to slip through despite official orders.": "Aid_Slums",
                                                      "Refuse entirely, publicly protesting that such cruelty is unjust.": "Protest_Nobles"
                                                  },
                                                  "outcomes": {
                                                      "Obey the nobles, quarantining the slums with harsh measures.": {
                                                          "text": "You did your job well, but at what cost? In close contact with the sick villagers, you begin to show symptoms yourself.",
                                                          "background": "slums.jpg",
                                                          "death": true
                                                      },
                                                      "Quietly allow aid to slip through despite official orders.": {
                                                          "text": "You face disciplinary actions, but the villagers' faith in you strengthens.",
                                                          "background": "village.jpg",
                                                          "death": false
                                                      },
                                                      "Refuse entirely, publicly protesting that such cruelty is unjust.": {
                                                          "text": "You clash head-on with the nobility, igniting open hostility.",
                                                          "background": "castle.jpg",
                                                          "death": false
                                                      }
                                          }
                                  },
       
              }
        }


